{
    "personal-info": {
        "full-name": "Claudio Pedalino",
        "date-of-birth": "1993-04-06",
        "main-position": "Senior .NET Software Engineer",
        "position-descripcion": "",
        "image-url": "assets/photo.jpg",
        "mail": "claudio.dpedalino@gmail.com",
        "location": "Argentina",
        "remote": "Remote only",
        "linkedin-url": "https://www.linkedin.com/in/claudio-pedalino/",
        "github-url": "https://github.com/ClaudioPedalino"
    },
    "tags": [
        {
            "title": "Goal",
            "icon": "goal.png",
            "descripcion": "Grow as a technical referent focusing on architecture & innovation"
        },
        {
            "title": "Looking For",
            "icon": "looking-for.png",
            "descripcion": "Cross-functional multidisciplinary teams, agile oriented with continuous learning & mentoring culture"
        }
    ],
    "work-experiences": [
        {
            "company-name": "Paramo Technologies",
            "from": "Dec-2021",
            "to": "Jan-2026",
            "position": "Senior .NET Software Engineer",
            "techs": ".NET 6/8, Microservices, Docker, SQL Server,PostgreSQL, RabbitMQ, Redis, ArgoCD, Kubernetes",
            "business-area": "Sports Betting",
            "tasks-descriptions": [
                "Development of new features for an high-volume sportsbook betting platform .",
                "Migration, refactoring and maintenance of legacy systems towards a microservices architecture."
            ]
        },
        {
            "company-name": "Geovictoria",
            "from": "Jul-2021",
            "to": "Dec-2021",
            "position": "Full-Stack Developer",
            "techs": ".NET Core, Azure, Docker, SQL Server, Microservices, Bubble.io",
            "business-area": "SaaS attendance control",
            "tasks-descriptions": [
                "Development of new functionalities for a high-transaction, multi-brand product.",
                "Migration of existing legacy systems into a distributed services architecture."
            ]
        },
        {
            "company-name": "Algeiba",
            "from": "Jan-2021",
            "to": "Jun-2021",
            "position": "Full-Stack Developer",
            "techs": ".NET 5, Azure, SQL Server, Microservices, Angular",
            "business-area": "Insurance",
            "tasks-descriptions": [
                "Development and modernization of management products oriented of the adoption of microservices architecture to decuple complex legacy business scenarios.",
                "Requirements analysis and task estimation in an agile environment."
            ]
        },
        {
            "company-name": "Totvs",
            "from": "Jul-2019",
            "to": "Jan-2021",
            "position": "Full-Stack Developer",
            "techs": ".NET Core 3.1, Angular 8-10, Docker, PostgreSQL, SQL Server",
            "business-area": "Hospitality & Online Payments",
            "tasks-descriptions": [
                "Development of new functionalities for a multi-brand hospitality system.",
                "Participation in architectural improvements and performance optimizations.",
                "Migration of a desktop-based payment integrator module to a Web API project."
            ]
        },
        {
            "company-name": "Jacaranda IT",
            "from": "Apr-2021",
            "to": "Oct-2021",
            "position": "Full-Stack Developer (Freelance)",
            "techs": ".NET Core 3.1, Vue 3, MySQL",
            "business-area": "CRM",
            "tasks-descriptions": [
                "Development of new functionalities in a multi-brand CRM system.",
                "Enhancement of existing modules to improve performance and usability."
            ]
        },
        {
            "company-name": "Origin Software",
            "from": "Jun-2018",
            "to": "Jun-2019",
            "position": "Backend Developer",
            "techs": ".NET Core 2.1+,Elasticsearch, Docker, Azure, Angular 8, Ionic 4, SQL Server, ",
            "business-area": "Tourism & E-Food",
            "tasks-descriptions": [
                "Development of new functionalities in a travel platform.",
                "Optimization of distributed services and search infrastructure.",
                "Implementation of web and mobile features using Angular and Ionic."
            ]
        },
        {
            "company-name": "Maer Software",
            "from": "Nov-2017",
            "to": "May-2018",
            "position": "Jr Backend Developer",
            "techs": ".NET Framework, SQL Server",
            "business-area": "ERP",
            "tasks-descriptions": [
                "Maintenance and development of a on premise multi-brand ERP system.",
                "Bug fixing, performance tuning and incremental feature development."
            ]
        }
    ],
        "skills": [
          {
            "order": 1,
            "area": "Backend",
            "area-image": "backend.png",
            "chips": [
              ".NET 6/8 | ASP.NET Core | Microservices | Messaging | Distributed Systems"
            ],
            "description": "Backend is my main focus. I design and evolve APIs and microservices in .NET, both from scratch and within existing architectures. I have taken architectural decisions in some teams and followed defined guidelines in others, always contributing improvements where possible. I have hands-on experience with distributed systems, including messaging (RabbitMQ, Azure Service Bus), caching strategies, concurrency handling, and production troubleshooting. Performance tuning and API design are areas where I feel most confident. I have worked with tools such as EF Core, Dapper, MediatR, FluentValidation, Serilog, Redis, Polly, gRPC, and benchmarking/load testing libraries in real production scenarios."
          },
          {
            "order": 2,
            "area": "Infrastructure",
            "area-image": "infraestructura (1).png",
            "chips": [
              "Docker | Azure | CI/CD | Kubernetes (Basic) | Observability"
            ],
            "description": "Comfortable working with containerized environments using Docker, writing and adapting Dockerfiles as needed. I have worked with CI/CD pipelines (Azure DevOps, Jenkins, GitHub Actions) and understand deployment flows across environments. I have practical exposure to Kubernetes manifests and deployment configurations, mainly applying changes and understanding production setups rather than designing clusters from scratch. In Azure, I have worked with services such as App Services, databases, caching, Azure Service Bus, Functions, and related cloud components. I have configured dashboards and worked with observability stacks including Grafana, Prometheus, Jaeger, and centralized logging solutions to monitor distributed systems."
          },
          {
            "order": 3,
            "area": "Data",
            "area-image": "database-storage.png",
            "chips": [
              "SQL Server | PostgreSQL | Redis | MongoDB | Elasticsearch"
            ],
            "description": "Strong working experience with SQL Server and PostgreSQL in microservices environments. I design data models for services, write non-trivial SQL queries, and handle query optimization when performance issues arise. I am not a database specialist, but I am comfortable working with indexing strategies, relational modeling, and production debugging. In NoSQL scenarios, I have worked with Redis (caching and distributed scenarios), MongoDB, and Elasticsearch. I have also been involved in pub/sub and event-driven flows integrated with messaging systems such as RabbitMQ and Kafka."
          },
          {
            "order": 4,
            "area": "Testing",
            "area-image": "icons8-ab-60.png",
            "chips": [
              "Unit Testing | Integration Testing | Load Testing | Performance Testing"
            ],
            "description": "I regularly write unit tests for backend services and APIs, following the testing standards defined by each team. I have also implemented integration tests and load/performance tests when required. I have worked with C# testing frameworks, k6, and NBomber for load and performance scenarios, mainly targeting APIs and distributed services. I have used Testcontainers in some projects, although my experience with it is still limited. Testing strategies were typically defined by QA or team guidelines; my responsibility was implementing and maintaining reliable test coverage aligned with those standards."
          },
          {
            "order": 5,
            "area": "Communication",
            "area-image": "http.png",
            "chips": [
              "REST | gRPC | API Versioning | External Integrations"
            ],
            "description": "Experience designing REST APIs from scratch, defining contracts, handling versioning strategies, and implementing backward-compatible changes. I have worked with gRPC in microservices-based systems and maintained legacy SOAP integrations when required. Comfortable integrating and consuming internal and third-party APIs in complex distributed environments, ensuring reliability and clear service contracts."
          },
          {
            "order": 6,
            "area": "Infrastructure & Versioning",
            "area-image": "git.png",
            "chips": [
              "Git | Pull Requests | Code Reviews | SVN (Legacy)"
            ],
            "description": "Daily use of Git in collaborative environments, working with pull requests, code reviews, and standard branching strategies. Comfortable in workflows enforced by CI pipelines and protected branches. Experience with Azure DevOps, GitHub, GitLab, and Bitbucket repositories. Limited exposure to SVN and TFS in legacy environments."
          },
          {
            "order": 7,
            "area": "Agile",
            "area-image": "scrum.png",
            "chips": [
              "Scrum | Kanban | Iterative Delivery"
            ],
            "description": "Extensive experience working in agile teams using Scrum, Kanban, or hybrid approaches. Active participant in planning, estimation, refinements, and retrospectives. While I have not held formal Scrum Master roles, I understand agile workflows deeply and contribute to delivery planning, feature ownership, and continuous improvement within backend-focused teams."
          },
          {
            "order": 8,
            "area": "Frontend",
            "area-image": "ux.png",
            "chips": [
              "Angular | TypeScript | JavaScript | Vue | Ionic"
            ],
            "description": "While backend is my core strength, I have delivered complete frontend features in Angular-based applications, including UI components, state handling, and API integrations. I usually join existing frontend architectures and extend functionality rather than defining architectural foundations. I feel comfortable implementing medium-complexity features and debugging issues, but I position myself primarily as a backend-focused engineer who can collaborate effectively on frontend tasks when needed."
          },
          {
            "order": 9,
            "area": "AI & Developer Productivity",
            "area-image": "ai.png",
            "chips": [
              "AI-assisted Development | LLMs | Cursor | AI Tooling | MCP"
            ],
            "description": "I actively leverage AI-assisted development tools to enhance productivity and code quality. Regular user of Cursor, Antigravity, and multiple large language models for architectural exploration, refactoring, test generation, and documentation support. I understand the fundamentals of how different LLMs operate, their trade-offs, and practical use cases in software development workflows. Familiar with configuring development environments to maximize AI integration, including the use of MCP servers and advanced editor tooling. I see AI as a productivity multiplier that complements engineering judgment rather than replacing it."
          },
          {
            "order": 10,
            "area": "Languages",
            "area-image": "signs.png",
            "chips": [
              "English B2 | Spanish Native | Portuguese Basic"
            ],
            "description": "English: Upper-intermediate (B2) with strong reading and listening skills, and conversational speaking and writing. Spanish: Native. Portuguese: Basic conversational familiarity after working in a Brazilian company."
          }
        ]
      }
      