{
    "personal-info": {
        "full-name": "Claudio Pedalino",
        "date-of-birth": "1993-04-06",
        "main-position": "Senior .NET Software Engineer",
        "position-descripcion": "",
        "image-url": "https://media.licdn.com/dms/image/v2/C4E03AQEzMNeul6yHqA/profile-displayphoto-shrink_400_400/profile-displayphoto-shrink_400_400/0/1589174300420?e=1771459200&v=beta&t=g7i1DXriLlnjLIC8uycjY-nWYRZISKWiZTqTggvX8AY",
        "mail": "claudio.dpedalino@gmail.com",
        "location": "Argentina",
        "remote": "Remote only",
        "linkedin-url": "https://www.linkedin.com/in/claudio-pedalino/",
        "github-url": "https://github.com/ClaudioPedalino"
    },
    "tags": [
        {
            "title": "Goal",
            "icon": "goal.png",
            "descripcion": "Grow as a technical referent focusing on architecture & innovation"
        },
        {
            "title": "Looking For",
            "icon": "looking-for.png",
            "descripcion": "Cross-functional multidisciplinary teams, agile oriented with continuous learning & mentoring culture"
        }
    ],
    "work-experiences": [
        {
            "company-name": "Paramo Technologies",
            "from": "Dec-2021",
            "to": "Jan-2026",
            "position": "Senior .NET Software Engineer",
            "techs": ".NET 6/8, Microservices, Docker, SQL Server,PostgreSQL, RabbitMQ, Redis, ArgoCD, Kubernetes",
            "business-area": "Sports Betting",
            "tasks-descriptions": [
                "Development of new features for an high-volume sportsbook betting platform .",
                "Migration, refactoring and maintenance of legacy systems towards a microservices architecture."
            ]
        },
        {
            "company-name": "Geovictoria",
            "from": "Jul-2021",
            "to": "Dec-2021",
            "position": "Full-Stack Developer",
            "techs": ".NET Core, Azure, Docker, SQL Server, Microservices, Bubble.io",
            "business-area": "SaaS attendance control",
            "tasks-descriptions": [
                "Development of new functionalities for a high-transaction, multi-brand product.",
                "Migration of existing legacy systems into a distributed services architecture."
            ]
        },
        {
            "company-name": "Algeiba",
            "from": "Jan-2021",
            "to": "Jun-2021",
            "position": "Full-Stack Developer",
            "techs": ".NET 5, Azure, SQL Server, Microservices, Angular",
            "business-area": "Insurance",
            "tasks-descriptions": [
                "Development and modernization of management products oriented of the adoption of microservices architecture to decuple complex legacy business scenarios.",
                "Requirements analysis and task estimation in an agile environment."
            ]
        },
        {
            "company-name": "Totvs",
            "from": "Jul-2019",
            "to": "Jan-2021",
            "position": "Full-Stack Developer",
            "techs": ".NET Core 3.1, Angular 8-10, Docker, PostgreSQL, SQL Server",
            "business-area": "Hospitality & Online Payments",
            "tasks-descriptions": [
                "Development of new functionalities for a multi-brand hospitality system.",
                "Participation in architectural improvements and performance optimizations.",
                "Migration of a desktop-based payment integrator module to a Web API project."
            ]
        },
        {
            "company-name": "Jacaranda IT",
            "from": "Apr-2021",
            "to": "Oct-2021",
            "position": "Full-Stack Developer (Freelance)",
            "techs": ".NET Core 3.1, Vue 3, MySQL",
            "business-area": "CRM",
            "tasks-descriptions": [
                "Development of new functionalities in a multi-brand CRM system.",
                "Enhancement of existing modules to improve performance and usability."
            ]
        },
        {
            "company-name": "Origin Software",
            "from": "Jun-2018",
            "to": "Jun-2019",
            "position": "Backend Developer",
            "techs": ".NET Core 2.1+,Elasticsearch, Docker, Azure, Angular 8, Ionic 4, SQL Server, ",
            "business-area": "Tourism & E-Food",
            "tasks-descriptions": [
                "Development of new functionalities in a travel platform.",
                "Optimization of distributed services and search infrastructure.",
                "Implementation of web and mobile features using Angular and Ionic."
            ]
        },
        {
            "company-name": "Maer Software",
            "from": "Nov-2017",
            "to": "May-2018",
            "position": "Jr Backend Developer",
            "techs": ".NET Framework, SQL Server",
            "business-area": "ERP",
            "tasks-descriptions": [
                "Maintenance and development of a on premise multi-brand ERP system.",
                "Bug fixing, performance tuning and incremental feature development."
            ]
        }
    ],
    "skills": [
        {
            "order": 1,
            "area": "Backend",
            "area-image": "backend.png",
            "chips": [
                "Net Core | Microservices | SOLID | Design Patterns"
            ],
            "description": "My main area of expertise is the .NET ecosystem, primarily focused on microservices and distributed architectures. I am deeply interested in software architecture and continuously invest time in learning best practices, patterns, and emerging technologies. I have strong experience with event-driven systems, messaging, performance optimization, and observability. Although C# is my core language, I have worked with Python and Node.js in specific contexts, reinforcing my problem-solving mindset beyond language boundaries. I have used libraries and tools such as EF Core, Dapper, MediatR, FluentValidation, Serilog, IdentityServer, JWT, Redis, Polly, Jaeger, Prometheus, RabbitMQ, gRPC, NBomber, BenchmarkDotNet, and many others across multiple projects."
        },
        {
            "order": 2,
            "area": "Infrastructure",
            "area-image": "infraestructura (1).png",
            "chips": [
                "Docker | Kubernetes | Azure | CI/CD | Observability"
            ],
            "description": "Experience containerizing applications with Docker and working with Kubernetes in production scenarios. Strong interest in observability, monitoring, and metrics, using tools such as Grafana, Prometheus, New Relic, Graylog, Kibana, Seq, Loki, Jaeger, and Ocelot. Familiar with Azure cloud services and Azure DevOps pipelines for CI/CD. For personal projects, I use GitHub Actions and Heroku. I also have limited exposure to AWS and am motivated to deepen cloud architecture expertise."
        },
        {
            "order": 3,
            "area": "Frontend",
            "area-image": "ux.png",
            "chips": [
                "Angular | TypeScript | JavaScript | Vue | Ionic | Bubble.io"
            ],
            "description": "Worked with Angular in multiple professional projects, as well as Vue and Ionic in specific scenarios. While my core strength is backend development, I collaborate effectively on medium-complexity frontend tasks. Interested in gaining hands-on experience with React and participating in mobile-focused projects. Experienced with low-code platforms such as Bubble.io, Glide, and Buildbase for rapid development and integrations."
        },
        {
            "order": 4,
            "area": "Data",
            "area-image": "database-storage.png",
            "chips": [
                "SQL Server | PostgreSQL | Redis | MongoDB | Elasticsearch | MySQL"
            ],
            "description": "Strong SQL background working primarily with SQL Server and PostgreSQL, with additional experience in MySQL. Experience with NoSQL technologies including Elasticsearch, MongoDB, and Redis in distributed environments. Used Firebase for personal projects and explored CosmosDB and DynamoDB in training scenarios. Also experimented with Airtable, Prisma, and FaunaDB for lightweight or self-managed solutions."
        },
        {
            "order": 5,
            "area": "Testing",
            "area-image": "icons8-ab-60.png",
            "chips": [
                "Unit Testing | Integration Testing | Load Testing | Performance Testing"
            ],
            "description": "Backend-oriented testing experience including unit tests with required code coverage thresholds. I have performed integration testing using Postman collections and tools such as k6. Additionally, I conducted load and performance testing using k6, Locust, JMeter, NBomber, and external load-testing services targeting APIs and distributed systems."
        },
        {
            "order": 6,
            "area": "Versioning",
            "area-image": "git.png",
            "chips": [
                "Git | SVN | TFS | Azure DevOps"
            ],
            "description": "Strong experience with Git in professional environments, working with branching strategies and collaborative workflows. I have mainly used Azure DevOps repositories, but also worked with GitHub, GitLab, and Bitbucket. In legacy environments, I have experience using SVN and TFS."
        },
        {
            "order": 7,
            "area": "Blockchain",
            "area-image": "blockchain.png",
            "chips": [
                "Web3 | Solidity | Smart Contracts | Ethereum"
            ],
            "description": "Currently expanding knowledge in Web3 and decentralized application development. Learning Solidity for smart contract creation using Truffle, Hardhat, Remix, and OpenZeppelin. Familiar with wallet integrations and DApp interaction. Used Nethereum to integrate .NET applications with the Ethereum blockchain."
        },
        {
            "order": 8,
            "area": "Agile",
            "area-image": "scrum.png",
            "chips": [
                "Scrum | Kanban | Agile Methodologies"
            ],
            "description": "Experience working in agile teams using Scrum, Kanban, or hybrid approaches depending on project needs. Strong belief in collaborative environments, iterative delivery, and continuous improvement processes."
        },
        {
            "order": 9,
            "area": "Communication",
            "area-image": "http.png",
            "chips": [
                "REST | gRPC | SOAP | API Integration"
            ],
            "description": "Extensive experience designing and integrating REST APIs. Worked with SOAP in legacy systems and implemented gRPC communication in microservices-oriented projects. Strong understanding of service contracts, interoperability, and distributed communication patterns."
        },
        {
            "order": 10,
            "area": "Languages",
            "area-image": "signs.png",
            "chips": [
                "English B2 | Spanish Native | Portuguese Basic"
            ],
            "description": "English: Upper-intermediate (B2) with strong reading and listening skills, conversational speaking and writing. Currently taking classes with multiple teachers and working in partially English-speaking environments. Spanish: Native. Portuguese: Basic conversational familiarity after working over a year in a Brazilian company."
        }
    ]
}